-- zh_CN
G_LANGUAGE = G_LANGUAGE or "zh_CN";
GV_ERRORS = {};
GV_ERRORS["zh_CN"] = {

	[0] = "调用成功",

	[-100] = "PG新建记录失败",
	[-101] = "该PG记录不存在",
	[-102] = "删除PG记录失败",

	[-1000] = "该应用尚未配置",
	[-1001] = "应用配置失败",
	[-1002] = "应用更新失败",

	[-10010] = "用户不存在",
	[-10011] = "用户已存在",
	[-10012] = "非法的openid",

	[-10020] = "会话不存在",
	[-10021] = "注册模式异常",

	[-10030] = "短信发送失败",
	
	[-10040] = "令牌已失效",
	[-10041] = "验证码错误",
	[-10042] = "手机号错误",
	[-10043] = "步骤错误",
	[-10044] = "未提供绑定密码",
	[-10045] = "绑定手机失败",
	[-10046] = "绑定手机参数缺失",
	[-10047] = "qq_id无效",
--[[
	[-10045] = "包名错误",
	[-10046] = "重定向url错误",
--]]	
	[-10050] = "新建用户失败",
	[-10051] = "获取用户信息失败",
	[-10052] = "用户密码错误",
	[-10053] = "更新用户信息失败",
	[-10054] = "非法的用户信息格式",
	[-10055] = "非法的用户列表",
	[-10056] = "获取用户信息列表失败",
	
	[-10060] = "令牌用户不符",

	[-10070] = "密码错误",
	[-10071] = "修改密码失败",

	[-10080] = "修改密码模式异常",
	[-10081] = "验证码错误",
	[-10082] = "更新密码失败",

	[-10090] = "邮件记录不存在",
	[-10091] = "未提供密码",
	[-10092] = "未提供绑定帐号",
	[-10093] = "创建邮箱会话失败",
	[-10094] = "删除邮箱会话失败",
	[-10095] = "绑定邮箱参数缺失",

	[-10100] = "未获取到邮箱会话",
	[-10101] = "邮箱校验码错误",
	[-10102] = "更新邮箱状态失败",
	[-10103] = "修改邮箱密码失败",
	[-10104] = "邮箱会话已过期",

	[-10200] = "应用尚未申请接入Oauth",
	[-10201] = "设置应用Oauth信息失败",

	[-10300] = "未获取到会话信息",
	[-10301] = "id不符合会话记录",
	[-10302] = "权限不符",
	[-10303] = "未找到用户信息",
	[-10304] = "非法的权限",

	[-10400] = "非法的第三方用户信息",

	[-100000] = "该应用尚未接入授权",
	[-100001] = "appid校验错误",
};

GV_TIPS = {};
GV_TIPS["zh_CN"] = {
	[1000] = "匿名用户",
	[1001] = 2,
	[1002] = "用户已存在",
	[1003] = "验证码正确",

	[1010] = "卓易帐号邮件注册",
	[1011] = "卓易帐号找回密码",
	[1012] = "卓易帐号邮件绑定",
	[1013] = "您好，亲爱的用户%s，欢迎注册卓易帐号，请点击以下链接完成注册：<br /><a href='%s'>点击这里</a><br />(如果无法点开，请复制链接以下至浏览器)<br />%s<br />您以后可以使用该邮箱作为您的登录帐号。<br />此邮件由系统自动发出,请勿直接回复。<br />【卓易帐号】",
	[1014] = "亲爱的用户%s，请点击以下链接重置密码：<br /><a href='%s'>点击这里</a><br />(如果无法点开，请复制链接以下至浏览器)<br />%s<br />此邮件由系统自动发出,请勿直接回复。<br />【卓易帐号】",
	[1015] = "您好，亲爱的用户%s，欢迎绑定卓易帐号，请点击以下链接完成绑定：<br /><a href='%s'>点击这里</a><br />(如果无法打开，请复制以下链接至浏览器)<br />%s<br />此邮件由系统自动发出,请勿直接回复。<br />【卓易帐号】",
	[1016] = "邮件已经发送。",

	[1020] = "密码修改成功", 
};

GV_LANG = {};
GV_LANG["zh_CN"] = {
	[1001] = "登录",
	[1002] = "卓易登录",
	[1003] = "注册",
	[1004] = "提交",
	[1005] = "登&nbsp;&nbsp;&nbsp;录",
	[1006] = "重置密码",
	[1007] = "设置密码",
	[1008] = "请输入帐号",
	[1009] = "发送邮件",
	[1010] = "邮件已发送至",
	[1011] = "重新发送",
	[1012] = "完&nbsp;&nbsp;&nbsp;成",
	[1013] = "激活邮件已发送",
	[1014] = "帐号注册",
	[1015] = "邮箱/手机号",
	[1016] = "请输入密码",
	[1017] = "我已阅读并同意",
	[1018] = "使用条款和隐私政策",
	[1019] = "确&nbsp;&nbsp;&nbsp;定",
	[1020] = "请输入验证码",
	[1021] = "上一步",
	[1022] = "下一步",
	[1023] = "获取验证码",
	--[1024] = "请(%d)秒后重新发送",
	[1024] = function(tab) 
				for i=60 ,0 ,-1 do tab[i] =  ("请(%d)秒后重新发送"):format(i) end
				return tab ;
			end,
	[1025] = "密码验证",
	[1026] = "新密码",
	[1027] = "确认密码",
	[1028] = "密码长度最少6位，最多12个字符",
	[1029] = "腾讯QQ登录",
	[1030] = "新浪微博登录",
	[1031] = "Facebook登录",
	[1032] = "找回密码",
	[1033] = [[{result = -408 ,desc = '网络错误!'}]],
	[1034] = "网络不给力，请检查后重试",
	[1035] = "帐号中包含汉字",
	[1036] = "请输入正确的邮箱或手机号",
	[1037] = "登录成功",
	[1038] = "登录失败，请输入正确的帐号或密码",
	[1039] = {"邮件发送中...(1s)","邮件发送中...(2s)","邮件发送中...(3s)","邮件发送中...(4s)","邮件发送中...(5s)"},
	[1040] = "验证码已下发，请及时查收",
	[1041] = "请确认密码是否一致",
	[1042] = "密码重置成功，请及时登录",
	[1043] = "重置密码失败，请稍后再试",
	[1044] = "注册成功，请及时登录",
	[1045] = "用户已存在，请修改后再试",
	[1046] = "注册失败，请稍后再试",
	[1047] = "发生错误",
	[1048] = "找回密码",
	[1049] = "恭喜你注册成功",
	[1050] = "链接已失效",
	[1051] = "请填写有效的密码",
	[1052] = "密码中不能包含空格",
	[1053] = "邮件发送中",
	[1054] = "邮件发送成功",
	[1055] = "邮件发送失败",

	[1056] = "密码修改成功",
	[1057] = "请确认密码是否一致",
	[1058] = "密码长度过短",
	[1059] = "密码长度过长",

	[1060] = "绑定邮箱",
	[1061] = "恭喜你绑定成功",
};

